Autodesk.Revit.DB.IFC.ExporterIFCUtils.GetRoomBoundaryAsCurveLoopArray(Autodesk.Revit.DB.SpatialElement,Autodesk.Revit.DB.SpatialElementBoundaryOptions,System.Boolean)
Obtains the spatial element boundary curves as an array of CurveLoops, needed for processing into IFC-specific
elements later.
spatialElement:
The spatial element.
options:
The options for extraction of the boundaries.
cleanCurves:
If true, curves will be trimmed to meet their neighbors.  If false, no trimming will take place.
Returns:
The list of CurveLoops, which could be empty if the routine is unable to get the boundary curve loops.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Throws an exception if any of the boundary loops are invalid or degenerate.
Since:
2012